---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.ApprovalTypeId
source: html/5257d862-ab65-0c35-bdb8-b6b69b627122.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.ApprovalTypeId Property

Retrieves or changes approval type of the Structural Connection Handler.

## Syntax (C#)
```csharp
public ElementId ApprovalTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null